# Задача 32: Определить индексы элементов массива (списка),
# значения которых принадлежат заданному диапазону (т.е. не
# меньше заданного минимума и не больше заданного
# максимума)
# Ввод: [-5, 9, 0, 3, -1, -2, 1,
# 4, -2, 10, 2, 0, -9, 8, 10, -9,
# 0, -5, -5, 7]
# Вывод: [1, 9, 13, 14, 10]

# my_list = [-5, 9, 0, 3, -1, -2, 1, 4, -2, 10, 2, 0, -9, 8, 10, -9, 0, -5, -5, 7]
lst = input('Введите элементы массива через пробел -> ')
my_list = [int(i) for i in lst.split()]
minimum = int(input('Задайте минимум -> '))
maximum = int(input('Задайте максимум -> '))
sorted_list = []
for i in range(len(my_list)):
    if minimum <= my_list[i] <= maximum:
        sorted_list.append(my_list[i])
print(*sorted_list)

